Extensions/нп_ДатыЗапретаИзменения/configurator/InformationRegisters/нп_НастройкиАвтоматическойУстановкиДатЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>нп_НастройкиАвтоматическойУстановкиДатЗапрета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:DefinedType.АдресатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нп_СпособыРасчетаДатыЗапрета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Вариант относительной даты БСП, например КонецПрошлогоМесяца</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейРазрешения</Name>
					<Comment>Сдвиг относительной даты, как в типовой форме</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Enums/нп_СпособыРасчетаДатыЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>нп_СпособыРасчетаДатыЗапрета</Name>
			<Comment>Скользящее окно, относительная дата БСП или оба правила сразу</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкользящееОкно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтносительнаяДата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комбинированная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/InformationRegisters/нп_НастройкиАвтоматическойУстановкиДатЗапрета/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.СпособРасчета) Тогда
		Запись.СпособРасчета = Перечисления.нп_СпособыРасчетаДатыЗапрета.СкользящееОкно;
	КонецЕсли;
	
	Если ТипЗнч(Запись.ОбъектДатыЗапрета) = Тип("СправочникСсылка.Организации") Тогда
		Организация = Запись.ОбъектДатыЗапрета;
	КонецЕсли;
	
	ЗаполнитьСписокОписанийДатыЗапрета();
	НастроитьКаскадПолей();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьОбъектЗаписи(ТекущийОбъект);
	нп_ДатыЗапретаИзменения.ПроверитьЗаписьНастройки(
		ТекущийОбъект.ОбъектДатыЗапрета,
		ТекущийОбъект.РазделДатыЗапрета);
	нп_ДатыЗапретаИзменения.ПроверитьСпособРасчетаНастройки(
		ТекущийОбъект.СпособРасчета,
		ТекущийОбъект.ЧислоДней,
		ТекущийОбъект.ОписаниеДатыЗапрета);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделДатыЗапретаПриИзменении(Элемент)
	
	РазделДатыЗапретаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектДатыЗапретаПриИзменении(Элемент)
	
	ОбновитьОписаниеРаздела();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	НастроитьПоляСпособаРасчета();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Организация)
		И нп_ДатыЗапретаИзменения.ЭтоРазделБезОрганизации(Запись.РазделДатыЗапрета) Тогда
		Запись.РазделДатыЗапрета = Неопределено;
		Запись.ОбъектДатыЗапрета = Неопределено;
	КонецЕсли;
	
	НастроитьКаскадПолей();
	
КонецПроцедуры

&НаСервере
Процедура РазделДатыЗапретаПриИзмененииНаСервере()
	
	Если нп_ДатыЗапретаИзменения.ЭтоРазделБезОрганизации(Запись.РазделДатыЗапрета) Тогда
		Организация = Неопределено;
		Если ТипЗнч(Запись.ОбъектДатыЗапрета) = Тип("СправочникСсылка.Организации") Тогда
			Запись.ОбъектДатыЗапрета = Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Запись.ОбъектДатыЗапрета) <> Тип("СправочникСсылка.Организации") Тогда
		Запись.ОбъектДатыЗапрета = Неопределено;
	КонецЕсли;
	
	НастроитьКаскадПолей();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКаскадПолей()
	
	РазделБезОрганизации = нп_ДатыЗапретаИзменения.ЭтоРазделБезОрганизации(Запись.РазделДатыЗапрета);
	
	Элементы.Организация.Видимость = Не РазделБезОрганизации;
	Элементы.ОбъектДатыЗапрета.Видимость = РазделБезОрганизации;
	
	Если РазделБезОрганизации Тогда
		Элементы.ОбъектДатыЗапрета.Заголовок = нп_ДатыЗапретаИзменения.ЗаголовокОбъектаРаздела(Запись.РазделДатыЗапрета);
		Элементы.ОбъектДатыЗапрета.ОграничениеТипа = нп_ДатыЗапретаИзменения.ОписаниеТипаОбъектаРаздела(
			Запись.РазделДатыЗапрета);
	КонецЕсли;
	
	ЗаполнитьСписокРазделов(ЗначениеЗаполнено(Организация));
	ОбновитьОписаниеРаздела();
	НастроитьПоляСпособаРасчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРазделов(ТолькоОрганизационные)
	
	Элементы.РазделДатыЗапрета.СписокВыбора.Очистить();
	Для Каждого СсылкаРаздела Из нп_ДатыЗапретаИзменения.СсылкиРазделовДляВыбора(ТолькоОрганизационные) Цикл
		Элементы.РазделДатыЗапрета.СписокВыбора.Добавить(СсылкаРаздела);
	КонецЦикла;
	Элементы.РазделДатыЗапрета.РежимВыбораИзСписка = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОписанийДатыЗапрета()
	
	Элементы.ОписаниеДатыЗапрета.СписокВыбора.Очистить();
	Для Каждого ЭлементСписка Из нп_ДатыЗапретаИзменения.СписокОписанийДатыЗапретаБСП() Цикл
		Элементы.ОписаниеДатыЗапрета.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	Элементы.ОписаниеДатыЗапрета.РежимВыбораИзСписка = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОписаниеРаздела()
	
	ОписаниеРаздела = нп_ДатыЗапретаИзменения.ТекстОписанияРаздела(
		Запись.РазделДатыЗапрета,
		ЗначениеЗаполнено(Организация));
	
	Если нп_ДатыЗапретаИзменения.ЭтоРазделБезОрганизации(Запись.РазделДатыЗапрета)
		И Не ЗначениеЗаполнено(Запись.ОбъектДатыЗапрета) Тогда
		ПредупреждениеПустого = нп_ДатыЗапретаИзменения.ТекстПредупрежденияПустогоОбъектаРаздела(
			Запись.РазделДатыЗапрета);
		Если ЗначениеЗаполнено(ПредупреждениеПустого) Тогда
			ОписаниеРаздела = СокрЛП(ОписаниеРаздела + Символы.ПС + ПредупреждениеПустого);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоляСпособаРасчета()
	
	СпособРасчета = Запись.СпособРасчета;
	Скользящее = Не ЗначениеЗаполнено(СпособРасчета)
		Или СпособРасчета = Перечисления.нп_СпособыРасчетаДатыЗапрета.СкользящееОкно;
	Относительное = СпособРасчета = Перечисления.нп_СпособыРасчетаДатыЗапрета.ОтносительнаяДата;
	Комбинированное = СпособРасчета = Перечисления.нп_СпособыРасчетаДатыЗапрета.Комбинированная;
	
	Элементы.ЧислоДней.Видимость = Скользящее Или Комбинированное;
	Элементы.ОписаниеДатыЗапрета.Видимость = Относительное Или Комбинированное;
	Элементы.КоличествоДнейРазрешения.Видимость = Относительное Или Комбинированное;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьОбъектЗаписи(ТекущийОбъект)
	
	Если нп_ДатыЗапретаИзменения.ЭтоРазделБезОрганизации(ТекущийОбъект.РазделДатыЗапрета) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.ОбъектДатыЗапрета = Организация;
	
КонецПроцедуры

#КонецОбласти
